## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [4]:
lst = [4,8,15,16,23,42]
ser = pd.Series(lst)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
type(ser)

pandas.core.series.Series

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [12]:
l = [1,2,'sudh',4,5,'krish',7,8,9,'pwskills']
print(pd.Series(l))

0           1
1           2
2        sudh
3           4
4           5
5       krish
6           7
7           8
8           9
9    pwskills
dtype: object

## Q3. Create a Pandas DataFrame that contains the following data:

In [13]:
data = {'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [15]:
## Dataframe is complete table.
## Where as series is collection of one or more columns in dataframe.

In [19]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
## Here df is dataframe.

In [23]:
df['Age']

0    25
1    30
2    27
Name: Age, dtype: int64

In [24]:
type(df['Age'])

pandas.core.series.Series

In [25]:
## Here single age column is series.

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [29]:
df.columns  ## this function gives total columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [31]:
df.head()  ## This function gives starting 5 rows by default

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [34]:
df.tail(1)  ## This function gives rows from last

     Name  Age  Gender
2  Claire   27  Female

In [38]:
df.dtypes  ## This function gives type of all columns

Name      object
Age        int64
Gender    object
dtype: object

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [39]:
## series is mutable
## DataFrame is mutable
## Panel is mutable

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [41]:
l1=[1,2,3]
l2=[4,5,6]
l3=[7,8,9]
l4=[l1,l2,l3]
df = pd.DataFrame(l4)

In [42]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9